# 7.Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

n = int (input('Введите номер четверти:'))
x = int
y = int
x != 0
y != 0

if n == 1:
    print('Диапазон возможных координат точек в 1-й четверти: x > 0 и y > 0')
elif n ==2:
    print('Диапазон возможных координат точек во 2-й четверти: x < 0 и y > 0')
elif n == 3:
    print('Диапазон возможных координат точек в 3-й четверти: x < 0 и y < 0')
elif n == 4:
    print('Диапазон возможных координат точек в 4-й четверти: x > 0 и y < 0')
